urzino/FanMonitoringBlueCoin/STM32CubeFunctionPack_ALLMEMS1_V3.2.0/Drivers/BSP/BlueCoin/BlueCoin_audio_in.c
  hAudioInI2s.Init.AudioFreq = ((BlueCoin_Audio_Handler.PDM_Clock_Freq * 1000) / 32);
  hAudioInI2s.Init.ClockSource  = I2S_CLOCK_PLL;
  hAudioInI2s.Init.CPOL         = I2S_CPOL_HIGH;
  hAudioInI2s.Init.MCLKOutput   = I2S_MCLKOUTPUT_DISABLE;
  hAudioInI2s.Init.Mode         = I2S_MODE_MASTER_RX;
  hAudioInI2s.Init.Standard     = I2S_STANDARD_MSB;
  hAudioInI2s.Init.FullDuplexMode   = I2S_FULLDUPLEXMODE_DISABLE;
  
  if(HAL_I2S_GetState(&hAudioInI2s) == HAL_I2S_STATE_RESET)
  {
    AUDIO_IN_I2S_MspInit();
  }
  
  if(HAL_I2S_Init(&hAudioInI2s) != HAL_OK)
  {
    return AUDIO_ERROR;
  }
  /*End I2S Init*/
  
  /*SPI Init*/
  if(BlueCoin_Audio_Handler.MicChannels > 2)
  {
    /* Set the SPI parameters */
    hAudioInSPI.Instance               = AUDIO_IN_SPI_INSTANCE;
    hAudioInSPI.Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_2;
    hAudioInSPI.Init.Direction         = SPI_DIRECTION_2LINES_RXONLY;
    hAudioInSPI.Init.CLKPhase          = SPI_PHASE_2EDGE;
    hAudioInSPI.Init.CLKPolarity       = SPI_POLARITY_HIGH;
    hAudioInSPI.Init.CRCCalculation    = SPI_CRCCALCULATION_DISABLED;
    hAudioInSPI.Init.CRCPolynomial     = 7;
    hAudioInSPI.Init.DataSize          = SPI_DATASIZE_16BIT;
    hAudioInSPI.Init.FirstBit          = SPI_FIRSTBIT_MSB;
    hAudioInSPI.Init.NSS               = SPI_NSS_SOFT;
    hAudioInSPI.Init.TIMode            = SPI_TIMODE_DISABLED;
    hAudioInSPI.Init.Mode              = SPI_MODE_SLAVE;
    
    /* Initialize the I2S peripheral with the structure above */
    if(HAL_SPI_GetState(&hAudioInSPI) == HAL_SPI_STATE_RESET)
    {
      AUDIO_IN_SPI_MspInit();
    }
    if(HAL_SPI_Init(&hAudioInSPI) != HAL_OK)
    {
      return AUDIO_ERROR;
    }
  }
  /*End SPI init*/
  
  /*PDM Filter Init*/
  BSP_AUDIO_IN_PDMToPCM_Init(BlueCoin_Audio_Handler.PCM_Sampling_Freq, BlueCoin_Audio_Handler.MicChannels,
                             BlueCoin_Audio_Handler.MicChannels);
                             
  /*End PDM Filter Init*/
  
  return AUDIO_OK;
}

/**
* @brief  Clock Config.

* @param  hi2s: I2S handle if required
* @param  Params: additional parameters where required
* @param  AudioFreq: Audio frequency used to play the audio stream.
* @note   This API is called by BSP_AUDIO_IN_Init()
*         Being __weak it can be overwritten by the application
* @retval AUDIO_OK if no problem during execution, AUDIO_ERROR otherwise
*/
__weak uint8_t BSP_AUDIO_IN_ClockConfig(I2S_HandleTypeDef *hi2s, uint32_t AudioFreq, void *Params)
{
  /*I2S PLL Configuration*/
  RCC_PeriphCLKInitTypeDef rccclkinit;
  HAL_RCCEx_GetPeriphCLKConfig(&rccclkinit);
  
  
  rccclkinit.PLLI2S.PLLI2SQ = 2;
  rccclkinit.PLLI2SDivQ = 1;
  
  if ((*(uint16_t *)Params) % 1280 == 0)
  {
    rccclkinit.PLLI2S.PLLI2SM = 10;
    rccclkinit.PLLI2S.PLLI2SN = 192;
    rccclkinit.PLLI2S.PLLI2SR = 5;
  }
  else
  {
    rccclkinit.PLLI2S.PLLI2SM = 16;
    rccclkinit.PLLI2S.PLLI2SN = 344;
    rccclkinit.PLLI2S.PLLI2SR = 7;
  }
  
  rccclkinit.PeriphClockSelection = RCC_PERIPHCLK_I2S_APB2;
  
  if(HAL_RCCEx_PeriphCLKConfig(&rccclkinit) != HAL_OK)
  {
    return AUDIO_ERROR;
  }
  
  return AUDIO_OK;
}

/**
* @brief  Starts audio recording.
* @param  * pbuf: Buffer that will contain 1 ms of PDM for each microphone.
Its dimension must be equal to (in uint16_t words):
((PCM sampling frequency)/1000 * DecimationFactor * Channels)/16
DecimationFactor is equal to 128 for 8000 KHZ sampling frequency, 64 in all the other cases
* @param  size: Not used in this driver.
* @retval AUDIO_OK in case of success, AUDIO_ERROR otherwise
*/
uint8_t BSP_AUDIO_IN_Record(uint16_t * pbuf, uint32_t size)
{

  BlueCoin_Audio_Handler.PDM_Data = pbuf;
  if(BlueCoin_Audio_Handler.MicChannels > 2)
  {
    if(HAL_SPI_Receive_DMA(&hAudioInSPI, (uint8_t *)SPI_InternalBuffer, BlueCoin_Audio_Handler.PdmBufferSize) != HAL_OK)
    {
      return AUDIO_ERROR;
    }
  }
  
  if(BlueCoin_Audio_Handler.MicChannels != 1)
  {
    if(AUDIO_IN_Timer_Start() != AUDIO_OK)
    {
      return AUDIO_ERROR;
    }
  }
  
  
  if(HAL_I2S_Receive_DMA(&hAudioInI2s, I2S_InternalBuffer, BlueCoin_Audio_Handler.PdmBufferSize / 2) != HAL_OK)
  {
    return AUDIO_ERROR;
  }
  
  /* Return 0 if all operations are OK */
  return AUDIO_OK;
}

/**
* @brief  Stops audio recording.
* @param  None
* @retval AUDIO_OK in case of success, AUDIO_ERROR otherwise
*/
uint8_t BSP_AUDIO_IN_Stop(void)
{
  if(BlueCoin_Audio_Handler.MicChannels > 2)
  {
    HAL_SPI_DMAStop(&hAudioInSPI);
  }
  
  if(AUDIO_IN_Timer_Stop() != AUDIO_OK)
  {
    return AUDIO_ERROR;
  }
  if(HAL_I2S_DMAStop(&hAudioInI2s) != HAL_OK)
  {
    return AUDIO_ERROR;
  }
  /* Return 0 if all operations are OK */
  return AUDIO_OK;
}

/**
* @brief  Controls the audio in volume level.
* @param  Volume: Volume level to be set for the PDM to PCM conversion.
Values must be in the range from 0 to 64
* @retval AUDIO_OK in case of success, AUDIO_ERROR otherwise
*/
uint8_t BSP_AUDIO_IN_SetVolume(uint8_t Volume)
{
  /* Set the Global variable AudioInVolume */
  AudioInVolume = Volume;
  /* Return AUDIO_OK when all operations are correctly done */
  return AUDIO_OK;
}

/**
* @brief  Converts audio format from PDM to PCM.
* @param  PDMBuf: Pointer to PDM buffer data
* @param  PCMBuf: Pointer to PCM buffer data
* @retval AUDIO_OK in case of success, AUDIO_ERROR otherwise
*/
__weak uint8_t BSP_AUDIO_IN_PDMToPCM(uint16_t *PDMBuf, uint16_t *PCMBuf)
{

   uint32_t index = 0;  
  uint32_t index1 = 0; 
  uint32_t index_ms = 0;
  uint16_t PDM_Offset = (BlueCoin_Audio_Handler.PdmBufferSize / (2 * N_MS_PER_INTERRUPT)) * BlueCoin_Audio_Handler.MicChannels;
  uint16_t PCM_Offset = (BlueCoin_Audio_Handler.MicChannels * (BlueCoin_Audio_Handler.PCM_Sampling_Freq / 1000));
  
  for (index_ms = 0; index_ms < N_MS_PER_INTERRUPT; index_ms ++)
  {
    if(BlueCoin_Audio_Handler.DecimationFactor == 128)
    {
      for(index = 0; index < BlueCoin_Audio_Handler.MicChannels; index++)
      {
        PDM_Filter_128_LSB(&((uint8_t*)(PDMBuf))[index + index_ms * PDM_Offset], (uint16_t*)&(PCMBuf[index + index_ms * PCM_Offset]), AudioInVolume , (PDMFilter_InitStruct *)&Filter[index]);
      }
    }    
    else if(BlueCoin_Audio_Handler.DecimationFactor == 64)
    {
      for(index = 0; index < BlueCoin_Audio_Handler.MicChannels; index++)
      {
        PDM_Filter_64_LSB(&((uint8_t*)(PDMBuf))[index + index_ms * PDM_Offset], (uint16_t*)&(PCMBuf[index + index_ms * PCM_Offset]), AudioInVolume , (PDMFilter_InitStruct *)&Filter[index]);
      }
    }     
    else if(BlueCoin_Audio_Handler.DecimationFactor == 80)
    {
      for(index = 0; index < BlueCoin_Audio_Handler.MicChannels; index++)
      {
        PDM_Filter_80_LSB(&((uint8_t*)(PDMBuf))[index + index_ms * PDM_Offset], (uint16_t*)&(PCMBuf[index + index_ms * PCM_Offset]), AudioInVolume , (PDMFilter_InitStruct *)&Filter[index]);
      }
    }
    else if(BlueCoin_Audio_Handler.DecimationFactor == 160)
    {      
      for(index = 0; index < BlueCoin_Audio_Handler.MicChannels; index++)
      {
        int16_t PCM_Decimator_IN[16];
        PDM_Filter_80_LSB(&((uint8_t*)(PDMBuf))[index + index_ms * PDM_Offset], (uint16_t*)(PCM_Decimator_IN), AudioInVolume , (PDMFilter_InitStruct *)&Filter[index]);       
#ifdef USE_ARM_DECIMATION
        int16_t PCM_Decimator_OUT[8];
        arm_fir_decimate_q15 (&ARM_Decimator_State[index], (q15_t *)PCM_Decimator_IN, (q15_t*)PCM_Decimator_OUT, DECIMATOR_BLOCK_SIZE);
#endif        
        for(index1 = 0; index1 < 8; index1++)
        {
#ifdef USE_ARM_DECIMATION
          PCMBuf[index1 * BlueCoin_Audio_Handler.MicChannels + index + index_ms * PCM_Offset] = PCM_Decimator_OUT[index1];
#else
          PCMBuf[index1 * BlueCoin_Audio_Handler.MicChannels + index + index_ms * PCM_Offset] = PCM_Decimator_IN[index1 * 2];
#endif
        }
      }      
    }
  }
  return AUDIO_OK;
}

/**
* @brief  Pauses the audio file stream.
* @param  None
* @retval AUDIO_OK in case of success, AUDIO_ERROR otherwise
*/
uint8_t BSP_AUDIO_IN_Pause(void)
{
  /* Call the Media layer pause function */
  HAL_I2S_DMAPause(&hAudioInI2s);
  
  /* Return AUDIO_OK when all operations are correctly done */
  return AUDIO_OK;
}

/**
* @brief  Resumes the audio file stream.
* @param  None
* @retval AUDIO_OK in case of success, AUDIO_ERROR otherwise
*/
uint8_t BSP_AUDIO_IN_Resume(void)
{
  /* Call the Media layer pause/resume function */
  HAL_I2S_DMAResume(&hAudioInI2s);
  
  /* Return AUDIO_OK when all operations are correctly done */
  return AUDIO_OK;
}


/**
* @brief Rx Transfer completed callbacks. It performs demuxing of the bit-interleaved PDM streams into
byte-interleaved data suitable for PDM to PCM conversion. 1 ms of data for each microphone is
written into the buffer that the user indicates when calling the BSP_AUDIO_IN_Start(...) function.
* @param hi2s: I2S handle
* @retval None
*/
void HAL_I2S_RxCpltCallback(I2S_HandleTypeDef *hi2s)
{

  uint32_t index = 0;
  
  switch(BlueCoin_Audio_Handler.MicChannels)
  {
    case 1:
    {
      uint16_t * DataTempI2S = &I2S_InternalBuffer[BlueCoin_Audio_Handler.PdmBufferSize / 4] ;
      for(index = 0; index < BlueCoin_Audio_Handler.PdmBufferSize / 4; index++)
      {
        BlueCoin_Audio_Handler.PDM_Data[index] = HTONS(DataTempI2S[index]);
      }
      break;
    }
    
